results/memcached_bench.txt
============================================================
backend=memcached pipeline=1 started=2026-04-25T08:13:38Z
4         Threads
20        Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       128096.72          ---          ---         0.56078         0.39900         3.87100         9.40700    260946.18 
Gets        14230.97      3252.66     10978.32         0.56982         0.40700         3.87100         9.79100      6934.01 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     142327.69      3252.66     10978.32         0.56168         0.39900         3.87100         9.47100    267880.19 

============================================================
backend=memcached pipeline=10 started=2026-04-25T08:13:59Z
4         Threads
20        Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       212378.38          ---          ---         3.38703         2.97500        10.04700        25.98300    432636.43 
Gets        23595.65     10486.03     13109.62         3.38721         2.97500        10.04700        26.23900     21832.08 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     235974.03     10486.03     13109.62         3.38705         2.97500        10.04700        26.11100    454468.51 

============================================================
backend=memcached pipeline=50 started=2026-04-25T08:14:19Z
4         Threads
20        Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       217032.14          ---          ---        16.57929        16.38300        32.12700        55.55100    442116.61 
Gets        24112.32     13755.77     10356.55        16.58074        16.38300        32.12700        55.80700     28479.44 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     241144.45     13755.77     10356.55        16.57943        16.38300        32.12700        55.55100    470596.05