results/redis_bench.txt
============================================================
backend=redis pipeline=1 started=2026-04-25T08:12:37Z
4         Threads
20        Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       251361.70          ---          ---         0.28654         0.27900         0.47900         0.68700    514258.73 
Gets        27927.12     10313.81     17613.31         0.28659         0.27900         0.49500         0.68700     21704.02 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     279288.82     10313.81     17613.31         0.28654         0.27900         0.47900         0.68700    535962.74 

============================================================
backend=redis pipeline=10 started=2026-04-25T08:12:57Z
4         Threads
20        Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       706818.20          ---          ---         1.01743         1.03900         1.91100         3.21500   1446073.37 
Gets        78533.43     57614.66     20918.77         1.01745         1.03900         1.91100         3.23100    118368.07 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     785351.63     57614.66     20918.77         1.01744         1.03900         1.91100         3.21500   1564441.45 

============================================================
backend=redis pipeline=50 started=2026-04-25T08:13:18Z
4         Threads
20        Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       534062.16          ---          ---         6.73788         5.82300        19.19900        62.71900   1092633.20 
Gets        59338.51     52616.91      6721.60         6.73805         5.82300        19.19900        62.71900    107640.87 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     593400.67     52616.91      6721.60         6.73789         5.82300        19.19900        62.71900   1200274.08